In [2]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [3]:
path='../data/'

users = pd.read_csv(path+'users.csv')
books = pd.read_csv(path+'books.csv')
ratings = pd.read_csv(path+'train_ratings.csv')

print('users shape: ', users.shape)
print('books shape: ', books.shape)
print('train_ratings shape: ', ratings.shape)

users shape:  (68092, 3)
books shape:  (149570, 10)
train_ratings shape:  (306795, 3)

In [6]:
arr=[]
for i in books.isbn:
    arr.append(i[:2])

np.unique(arr)
#print(len(np.unique(arr)))

array(['00', '01', '02', '03', '04', '05', '06', '07', '08', '09', '14',
       '15', '17', '18', '19', '20', '21', '22', '25', '26', '27', '28',
       '29', '30', '31', '32', '33', '34', '35', '36', '37', '38', '39',
       '40', '41', '43', '44', '45', '46', '47', '48', '49', '50', '53',
       '54', '55', '58', '71', '75', '78', '80', '81', '82', '83', '84',
       '85', '86', '87', '88', '89', '90', '91', '92', '95', '96', '97',
       '98', '99', 'B0'], dtype='<U2')

### Data Overviews

In [145]:
users.head(10)

   user_id                            location   age
0        8            timmins, ontario, canada   NaN
1    11400             ottawa, ontario, canada  49.0
2    11676                       n/a, n/a, n/a   NaN
3    67544            toronto, ontario, canada  30.0
4    85526  victoria, british columbia, canada  36.0
5    96054             ottawa, ontario, canada  29.0
6   116866                           ottawa, ,   NaN
7   123629           kingston, ontario, canada   NaN
8   177458             ottawa, ontario, canada  29.0
9   200273             comber, ontario, canada   NaN

location은 (지역, 주, 국가) 순인데 n/a 값을 확인 가능 이는 isnull()로 확인이 불가하므로  location을 각각 truncate 해준 후 null값을 처리해줄 필요가 보인다.

In [146]:
users.describe()

             user_id           age
count   68092.000000  40259.000000
mean   139381.329539     36.069873
std     80523.969862     13.842571
min         8.000000      5.000000
25%     69008.750000     25.000000
50%    138845.500000     34.000000
75%    209388.250000     45.000000
max    278854.000000     99.000000

In [147]:
print(f"{users.dtypes}\n")

user_id       int64
location     object
age         float64
dtype: object

float일 필요가 없는 age는 int형으로 변환을 해준다.

In [148]:
books.head()

,isbn,book_title,book_author,year_of_publication,publisher,img_url,language,category,summary,img_path
0,0002005018,Clara Callan,Richard Bruce Wright,2001.0,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...,en,['Actresses'],"In a small town in Canada, Clara Callan reluct...",images/0002005018.01.THUMBZZZ.jpg
1,0060973129,Decision in Normandy,Carlo D'Este,1991.0,HarperPerennial,http://images.amazon.com/images/P/0060973129.0...,en,['1940-1949'],"Here, for the first time in paperback, is an o...",images/0060973129.01.THUMBZZZ.jpg
2,0374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999.0,Farrar Straus Giroux,http://images.amazon.com/images/P/0374157065.0...,en,['Medical'],"Describes the great flu epidemic of 1918, an o...",images/0374157065.01.THUMBZZZ.jpg
3,0399135782,The Kitchen God's Wife,Amy Tan,1991.0,Putnam Pub Group,http://images.amazon.com/images/P/0399135782.0...,en,['Fiction'],A Chinese immigrant who is convinced she is dy...,images/0399135782.01.THUMBZZZ.jpg
4,0425176428,What If?: The World's Foremost Military Histor...,Robert Cowley,2000.0,Berkley Publishing Group,http://images.amazon.com/images/P/0425176428.0...,en,['History'],"Essays by respected military historians, inclu...",images/0425176428.01.THUMBZZZ.jpg

In [149]:
books.describe()

       year_of_publication
count        149570.000000
mean           1994.590606
std               8.179733
min            1376.000000
25%            1991.000000
50%            1996.000000
75%            2000.000000
max            2006.000000

In [150]:
print(f"{books.dtypes}\n")

isbn                    object
book_title              object
book_author             object
year_of_publication    float64
publisher               object
img_url                 object
language                object
category                object
summary                 object
img_path                object
dtype: object

float일 필요가 없는 year_of_publication은 int형으로 변환을 해준다.

In [151]:
ratings.head()

   user_id        isbn  rating
0        8  0002005018       4
1    67544  0002005018       7
2   123629  0002005018       8
3   200273  0002005018       8
4   210926  0002005018       9

In [152]:
ratings.describe()

             user_id         rating
count  306795.000000  306795.000000
mean   136128.416099       7.069714
std     80512.194379       2.433217
min         8.000000       1.000000
25%     67591.000000       6.000000
50%    134076.000000       8.000000
75%    206438.000000       9.000000
max    278854.000000      10.000000

In [153]:
print(f"{ratings.dtypes}\n")

user_id     int64
isbn       object
rating      int64
dtype: object

### Changing datatypes

In [154]:
users['age'] = users['age'].replace(np.nan, 0) # null값이 존재하면 dtype 변경이 불가
users['age'] = users['age'].astype(int)
users['age'] = users['age'].replace(0, np.nan)
books['year_of_publication'] = books['year_of_publication'].astype(int)

### Truncate users location

In [155]:
"""
users['location']= users['location'].str.replace(pat=r'[^\w]',repl=r' ',regex=True) # 정규식으로 특수문자 제거
users['location'] = users['location'].replace('n a', np.nan)
location = users.location.str.split(' ', n=2, expand=True) # ',' 를 기준으로 split
location.columns=['city', 'state', 'country']

for i in location.columns:
    users[i] = location[i]
#users.head()


# Null값으로 변경
users = users.replace('n/a', np.nan) # 문자인 'n/a'를 Null로 변경
users = users.replace(',', np.nan)
"""

"\nusers['location']= users['location'].str.replace(pat=r'[^\\w]',repl=r' ',regex=True) # 정규식으로 특수문자 제거\nusers['location'] = users['location'].replace('n a', np.nan)\nlocation = users.location.str.split(' ', n=2, expand=True) # ',' 를 기준으로 split\nlocation.columns=['city', 'state', 'country']\n\nfor i in location.columns:\n    users[i] = location[i]\n#users.head()\n\n\n# Null값으로 변경\nusers = users.replace('n/a', np.nan) # 문자인 'n/a'를 Null로 변경\nusers = users.replace(',', np.nan)\n"

In [156]:
users['location'] = users['location'].str.replace(r'[^0-9a-zA-Z:,]', '') # 특수문자 제거

users['city'] = users['location'].apply(lambda x: x.split(',')[0].strip())
users['state'] = users['location'].apply(lambda x: x.split(',')[1].strip())
users['country'] = users['location'].apply(lambda x: x.split(',')[2].strip())

users = users.replace('na', np.nan) #특수문자 제거로 n/a가 na로 바뀌게 되었습니다. 따라서 이를 컴퓨터가 인식할 수 있는 결측값으로 변환합니다.
users = users.replace('', np.nan) # 일부 경우 , , ,으로 입력된 경우가 있었으므로 이런 경우에도 결측값으로 변환합니다.

In [157]:
users.head()

,user_id,location,age,city,state,country
0,8,"timmins, ontario, canada",NaN,timmins,ontario,canada
1,11400,"ottawa, ontario, canada",49.0,ottawa,ontario,canada
2,11676,"n/a, n/a, n/a",NaN,n/a,n/a,n/a
3,67544,"toronto, ontario, canada",30.0,toronto,ontario,canada
4,85526,"victoria, british columbia, canada",36.0,victoria,british columbia,canada

In [158]:
users.head(10)

,user_id,location,age,city,state,country
0,8,"timmins, ontario, canada",NaN,timmins,ontario,canada
1,11400,"ottawa, ontario, canada",49.0,ottawa,ontario,canada
2,11676,"n/a, n/a, n/a",NaN,n/a,n/a,n/a
3,67544,"toronto, ontario, canada",30.0,toronto,ontario,canada
4,85526,"victoria, british columbia, canada",36.0,victoria,british columbia,canada
5,96054,"ottawa, ontario, canada",29.0,ottawa,ontario,canada
6,116866,"ottawa, ,",NaN,ottawa,NaN,NaN
7,123629,"kingston, ontario, canada",NaN,kingston,ontario,canada
8,177458,"ottawa, ontario, canada",29.0,ottawa,ontario,canada
9,200273,"comber, ontario, canada",NaN,comber,ontario,canada

### 결측값 확인

In [159]:
users.isnull().sum()

user_id         0
location        0
age         27833
city           25
state        1818
country      2111
dtype: int64

location 중에 가장 작은 범위인 city의 결측치가 가장 작음을 알 수 있다. 따라서 city를 이용해 state와 country의 결측값을 추정 가능할것이다.

In [160]:
users[users['country'].isna()]

       user_id         location   age         city  state country
6       116866        ottawa, ,   NaN       ottawa    NaN     NaN
32      115097       seattle, ,  27.0      seattle    NaN     NaN
49      245827   albuquerque, ,   NaN  albuquerque    NaN     NaN
72      226745        humble, ,  38.0       humble    NaN     NaN
120      38718         aloha, ,   NaN        aloha    NaN     NaN
...        ...              ...   ...          ...    ...     ...
67797   257311   lisbon, maine,  36.0       lisbon  maine     NaN
67929   267240       houston, ,   NaN      houston    NaN     NaN
67930   267276     sammamish, ,   NaN    sammamish    NaN     NaN
68058   276221       calgary, ,   NaN      calgary    NaN     NaN
68068   276949  bolligen, bern,  24.0     bolligen   bern     NaN

[2111 rows x 6 columns]

In [161]:
users.isnull().sum()/len(users)

user_id     0.000000
location    0.000000
age         0.408756
city        0.000367
state       0.026699
country     0.031002
dtype: float64

users table에는 age의 결측값이 압도적으로 많음을 알 수 있다. (약 40%) 나머지 피쳐의 결측값는 3% 미만

In [162]:
books.isnull().sum()

isbn                       0
book_title                 0
book_author                1
year_of_publication        0
publisher                  0
img_url                    0
language               67227
category               68851
summary                67227
img_path                   0
dtype: int64

In [163]:
books.isnull().sum()/len(books)

isbn                   0.000000
book_title             0.000000
book_author            0.000007
year_of_publication    0.000000
publisher              0.000000
img_url                0.000000
language               0.449468
category               0.460326
summary                0.449468
img_path               0.000000
dtype: float64

language, category, summary의 결측값이 많음을 알 수 있다. (약 45%)

book_author는 결측치의 갯수가 1개이므로 drop해주어도 무방하다.

In [164]:
ratings.isnull().sum()

user_id    0
isbn       0
rating     0
dtype: int64

target 피처인 rating에는 결측치가 존재하지 않음을 알 수 있다.

### 결측값 처리

In [165]:
books['book_author'].dropna()

0         Richard Bruce Wright
1                 Carlo D'Este
2             Gina Bari Kolata
3                      Amy Tan
4                Robert Cowley
                  ...
149565           P.J. O'Rourke
149566            Sam Lightner
149567           Claude Dooley
149568            Jeremy Lloyd
149569                  Mapsco
Name: book_author, Length: 149569, dtype: object

In [166]:
modify_location = users[(users['country'].isna())&(users['city'].notnull())]['city'].values
location = users[(users['location'].str.contains('seattle'))&(users['country'].notnull())]['location'].value_counts().index[0]

location_list = []
for location in modify_location:
    try:
        right_location = users[(users['location'].str.contains(location))&(users['country'].notnull())]['location'].value_counts().index[0]
        location_list.append(right_location)
    except:
        pass

/tmp/ipykernel_3546/2892740803.py:7: UserWarning: This pattern is interpreted as a regular expression, and has match groups. To actually get the groups, use str.extract.
  right_location = users[(users['location'].str.contains(location))&(users['country'].notnull())]['location'].value_counts().index[0]
/tmp/ipykernel_3546/2892740803.py:7: UserWarning: This pattern is interpreted as a regular expression, and has match groups. To actually get the groups, use str.extract.
  right_location = users[(users['location'].str.contains(location))&(users['country'].notnull())]['location'].value_counts().index[0]

In [167]:
for location in location_list:
    users.loc[users[users['city']==location.split(',')[0]].index,'state'] = location.split(',')[1]
    users.loc[users[users['city']==location.split(',')[0]].index,'country'] = location.split(',')[2]

In [142]:
users.isna().sum()

user_id        0
age        27833
city          25
state       1818
country     2111
dtype: int64

In [168]:
users = users.drop('location', axis=1)

In [8]:
len(books.category.unique())

4293